<?php

return [
    //云账户key(云账户提供)
    'app_key'    => '',

    //DES加密串(云账户提供)
    'des3_key'   => '',

    //商户代码(云账户提供)
    'dealer_id'  => '',

    //代征主体(云账户提供)
    'broker_id'  => '',

    //回调地址
    'notify_url' => '',

    //微信app_id
    'wx_app_id'  => '',

    'status' => [
        -1 => ['删除', '被标记为删除的订单，只有通过web⻚⾯打款的情况才会出现（最终状态，不会回调），api接⼝打款不会出现此状态'],
        0  => ['已受理', '⽀付订单接收成功，尚未处理（中间状态，不会回调）'],
        1  => ['已打款', '订单提交到⽀付⽹关成功（中间状态，会回调）'],
        2  => ['打款失败', '主要表示订单数据校验不通过（最终状态，会回调）'],
        4  => ['待打款(暂停处理)', '暂停处理，满⾜条件后会继续⽀付，例如账户余额不⾜，充值后可以继续打款（中间状态，会回调）'],
        5  => ['打款中(状态未知)', '调⽤⽀付⽹关超时等状态异常情况导致，处于等待交易查证的中间状态（中间状态，不会回调）'],
        8  => ['待打款', '订单税务筹划完毕，等待执⾏打款的状态（中间状态，不会回调）'],
        9  => ['打款失败（已退款，退汇或者冲正)', '⽀付被退回（最终状态，会回调）'],
        15 => ['取消⽀付', '表示待打款(暂停处理)订单数据被商户主动取消（最终状态，会回调）'],
    ],

    'status_detail' => [
        0    => ['成功', '成功'],
        20   => ['账户余额不足', '账户余额不足'],
        22   => ['通道维护暂停打款', '通道维护暂停打款'],
        25   => ['要素认证情况未知', '要素认证情况未知'],
        28   => ['单笔打款超出限额', '单笔打款超出限额'],
        29   => ['用户未签约', '需要用户到云账户微信小程序进行签约'],
        213  => ['系统打款和代征主体打款都失败', '系统打款和代征主体打款都失败'],
        251  => ['身份证姓名不匹配', '身份证姓名不匹配'],
        252  => ['身份证号错误', '身份证号错误'],
        254  => ['银卡号错误', '银卡号错误'],
        255  => ['姓名和银行卡号不匹配', '姓名和银行卡号不匹配'],
        2552 => ['收款账号、户名不匹配', '姓名和银行卡号不匹配'],
        257  => ['银行卡受限', '银行卡受限'],
        2571 => ['II、III类账户不允许此交易', 'II、III类账户不允许此交易'],
        2572 => ['收款账户非法或睡眠', '收款账户非法或睡眠'],
        2573 => ['收款账户不合法或已注销或超过有效期', '收款账户不合法或已注销或超过有效期'],
        2574 => ['副卡不允许此交易', '副卡不允许此交易'],
        2575 => ['业务累计金额/笔数超过规定上限', '业务累计金额/笔数超过规定上限'],
        2582 => ['匹配⿊名单', '匹配⿊名单'],
        6053 => ['收款⾏收款失败，请联系发卡行', '收款⾏收款失败，请联系发卡⾏'],
        261  => ['⽀付宝账号错误', '支付宝账号错误'],
        262  => ['⽀付宝账号与姓名不匹配', '⽀付宝账号与姓名不匹配'],
        265  => ['身份证号或收款户名不可以为空', '身份证号或收款户名不可以为空'],
        266  => ['⽀付宝账号受限', '用户可能未完成⽀付宝实名认证'],
        5077 => ['收款⽅⽀付宝账户不存在', '用户⽀付宝账户填写错误或有隐私设置'],
        267  => ['该⼿机号对应多个⽀付宝账户', '该⼿机号对应多个⽀付宝账户'],
        271  => ['微信账号错误', '微信账号错误'],
        273  => ['此请求可能存在⻛险，已被微信拦截', '换⼀个活跃的微信号'],
        277  => ['OpenID和AppID不匹配’, ‘OpenID和AppID不匹配'],
        302  => ['报税⻛险：单⼈⽉⾦额超限', '税务⻛控挂单，该笔订单将造成签约关系下该⽤户打款额度超过累计额度配置'],
        304  => ['报税⻛险：单⼈年⾦额超限', '税务⻛控挂单，该笔订单将造成签约关系下该⽤户打款额度超过年累计额度配置'],
        305  => ['报税⻛险：单⼈全平台⽉⾦额超限', '税务⻛控挂单，该笔订单将造成单⼈全平台⽉累计超限'],
        2051 => ['微信转账打款失败', '微信转账打款失败(⼿动重试)'],
        2052 => ['没有该接⼝权限', '综合服务平台⾃动重试:没有该接⼝权限'],
        2053 => ['发送转账⾦额不在限制范围内', '转账失败:发送转账⾦额不在限制范围内'],
        2054 => ['微信账户余额不足', '综合服务平台⾃动重试:微信账户余额不⾜'],
        2055 => ['OpenID和AppID不匹', '转账失败:OpenID和AppID不匹配'],
        2056 => ['超过频率限制，请稍后再试', '综合服务平台⾃动重试:超过频率限制，请稍后再试'],
        2057 => ['姓名校验出错', '转账失败:姓名校验出错'],
        2058 => ['收款账户未实名', '转账失败:收款账户未实名'],
        2059 => ['微信转账订单不存在', '综合服务平台⼿动重试:微信转账订单不存在'],
        2060 => ['已经达到今⽇付款总额上限/已达到付款给此⽤户额度上限', '转账失败:已经达到今⽇付款总额上限/已达到付款给此⽤户额度上限'],
        2061 => ['该⽤户今⽇付款次数超过限制', '转账失败:该⽤户今⽇付款次数超过限制'],
        2068 => ['OpenID错误', '转账失败:OpenID错误'],
    ],
];
